УТ/src/InformationRegisters/АУ_ОповещенияОПоступленияхТоваров/АУ_ОповещенияОПоступленияхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_ОповещенияОПоступленияхТоваров</name>
  <resources>
    <name>ОповещениеСформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/АУ_СтавкиРефинансированияЦБ/АУ_СтавкиРефинансированияЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_СтавкиРефинансированияЦБ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/АУ_СоответствиеВидовНоменклатурыМаркировки/АУ_СоответствиеВидовНоменклатурыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_СоответствиеВидовНоменклатурыМаркировки</name>
  <resources>
    <name>ПарныйВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/АУ_ВидыЗаданий/АУ_ВидыЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АУ_ВидыЗаданий</name>
  <enumValues>
    <name>УточнениеДатыИсполненияКонтракта</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЗакупку</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПереходПраваСобственности</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВсегда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/АУ_Программы/АУ_Программы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АУ_Программы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатьяБюджетаПоУмолчаниюДляЗаказаКлиента</name>
    <type>
      <types>CatalogRef.АУ_СтатьиБюджета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>DefinedType.НомерСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительВЕТИС</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПартииВЕТИС</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <comment>Максимальная розничная цена (МОТП)</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатурыДляЦенообразования</name>
    <type>
      <types>CatalogRef.СерииНоменклатурыДляЦенообразования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/АУ_ОбщиеПроцедурыИФункцииСервер/Module.bsl
Функция ВидКИПартнераПоВидуКИКонтрагента(ВидКИКонтрагента, ИспользоватьПартнеровКакКонтрагентов) Экспорт
	ВидКиПартнера = Неопределено;
	
	Если ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
	ИначеЕсли ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
	ИначеЕсли ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
	ИначеЕсли ЗначениеЗаполнено(ВидКИКонтрагента) И ИспользоватьПартнеровКакКонтрагентов Тогда
		Если Не (ОбщегоНазначения.СсылкаСуществует(ВидКИКонтрагента)
			И ТипЗнч(ВидКИКонтрагента) = Тип("СправочникСсылка.ВидыКонтактнойИнформации")) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Поиск или создание прочих видов КИ.
		ЗначенияРеквизитовВидаКИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидКИКонтрагента, "Тип, Наименование"); // Структура
		
		ВидКИПартнера = ВидПользовательскойКонтактнойИнформации(ЗначенияРеквизитовВидаКИ.Наименование,
			Справочники.ВидыКонтактнойИнформации.СправочникПартнеры,
			ЗначенияРеквизитовВидаКИ.Тип);
		
	КонецЕсли;
	
	Возврат ВидКИПартнера;
КонецФункции

Функция ВидПользовательскойКонтактнойИнформации(НаименованиеКИ, ГруппаВидовКИ, ТипКИ)
	ТекВидКИ = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Ссылка В ИЕРАРХИИ(&ГруппаВидовКИ)
	|	И ВидыКонтактнойИнформации.Наименование = &Наименование
	|	И ВидыКонтактнойИнформации.Тип = &ТипКИ
	|	И ВидыКонтактнойИнформации.Используется = ИСТИНА
	|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ");
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
	Запрос.УстановитьПараметр("Наименование",  НаименованиеКИ);
	Запрос.УстановитьПараметр("ТипКИ",         ТипКИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекВидКИ = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекВидКИ) Тогда
		ТекВидКИ = НовыйВидКонтактнойИнформации(НаименованиеКИ, ГруппаВидовКИ, ТипКИ);
	КонецЕсли;
	
	Возврат ТекВидКИ;
КонецФункции

Функция НовыйВидКонтактнойИнформации(Наименование, Родитель, ТипКИ)
	ВидКИОбъект = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
	ВидКИОбъект.Родитель     = Родитель;
	ВидКИОбъект.Наименование = Наименование;
	ВидКИОбъект.Тип          = ТипКИ;
	ВидКИОбъект.Используется = Истина;
	ВидКИОбъект.Записать();
	
	Возврат ВидКИОбъект.Ссылка;
КонецФункции

Функция ВыполнитьЗапрос(Менеджер,Текст) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Менеджер;
	Запрос.Текст=Текст;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура АУ_ПриобретениеТоваровПриПроведенеииФормированиеОповещенийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	АУ_ОповещенияОПоступленияхТоваров.ОповещениеСформировано КАК ОповещениеСформировано
	             |ИЗ
	             |	РегистрСведений.АУ_ОповещенияОПоступленияхТоваров КАК АУ_ОповещенияОПоступленияхТоваров
	             |ГДЕ
	             |	АУ_ОповещенияОПоступленияхТоваров.Поступление = &Поступление";
	Запрос.УстановитьПараметр("Поступление",Источник.Ссылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() ИЛИ Выборка.ОповещениеСформировано=NULL Тогда
		
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ПриобретениеТоваровУслугТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		             |	ДокЗаказПоставщику.Контрагент КАК Контрагент
		             |ПОМЕСТИТЬ ВТЗаказыПоставщикам
		             |ИЗ
		             |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |ГДЕ
		             |	ПриобретениеТоваровУслугТовары.Ссылка = &Поступление
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ПриобретениеТоваровУслуг.ЗаказПоставщику,
		             |	ДокЗаказПоставщику.Контрагент
		             |ИЗ
		             |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ПриобретениеТоваровУслуг.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |ГДЕ
		             |	ПриобретениеТоваровУслуг.Ссылка = &Поступление
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ЗаказПоставщикуТовары.АУ_ЗаказКлиента КАК АУ_ЗаказКлиента,
		             |	ЗаказКлиента.АУ_Программа КАК АУ_Программа,
		             |	ЗаказКлиента.Контрагент КАК Контрагент
		             |ПОМЕСТИТЬ ВТЗаказыКлиентов
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗаказКлиента.Ссылка)
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ЗаказКлиента.Ссылка,
		             |	ЗаказКлиента.АУ_Программа,
		             |	ЗаказКлиента.Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ДокЗаказПоставщику.ДокументОснование = ЗаказКлиента.Ссылка)
		             |ГДЕ
		             |	ДокЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ЗаказКлиента.Ссылка,
		             |	ЗаказКлиента.АУ_Программа,
		             |	ЗаказКлиента.Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказНаСборку
		             |		ПО (ДокЗаказПоставщику.ДокументОснование = ЗаказНаСборку.Ссылка)
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ЗаказНаСборку.ДокументОснование = ЗаказКлиента.Ссылка)
		             |ГДЕ
		             |	ДокЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказНаСборку
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	АУ_ПрограммыОтветственные.Ответственный КАК Ответственный
		             |ИЗ
		             |	Справочник.АУ_Программы.Ответственные КАК АУ_ПрограммыОтветственные
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыКлиентов КАК ВТЗаказыКлиентов
		             |		ПО АУ_ПрограммыОтветственные.Ссылка = ВТЗаказыКлиентов.АУ_Программа
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыПоставщикам.ЗаказПоставщику) КАК ЗаказПоставщику,
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыПоставщикам.Контрагент) КАК Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыКлиентов.АУ_ЗаказКлиента) КАК ЗаказКлиента,
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыКлиентов.Контрагент) КАК Контрагент
		             |ИЗ
		             |	ВТЗаказыКлиентов КАК ВТЗаказыКлиентов";
		
		Пакет=Запрос.ВыполнитьПакет();
		Выборка=Пакет[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Задача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			Задача.Дата=ТекущаяДата();
			Задача.Наименование=СтрШаблон("Ознакомиться с поступлением товаров: %1 %2",Источник.Контрагент,Источник.Ссылка);
			Задача.Автор=Пользователи.АвторизованныйПользователь();
			Задача.Исполнитель=Выборка.Ответственный;
			Задача.ДатаИсполнения=КонецДня(ТекущаяДата());
			Задача.ДатаНачала=НачалоДня(ТекущаяДата());
			Задача.Предмет=Источник.Ссылка;
			Задача.ПредметСтрокой=Источник.Ссылка;
			Задача.СрокИсполнения=КонецДня(ТекущаяДата());
			
			МассивЗП=Новый Массив;
			ВыборкаДок=Пакет[3].Выбрать();
			Пока ВыборкаДок.Следующий() Цикл
				МассивЗП.Добавить(СтрШаблон("%1 %2",ВыборкаДок.Контрагент,ВыборкаДок.ЗаказПоставщику));
			КонецЦикла;
			МассивЗК=Новый Массив;
			ВыборкаДок=Пакет[4].Выбрать();
			Пока ВыборкаДок.Следующий() Цикл
				МассивЗП.Добавить(СтрШаблон("%1 %2",ВыборкаДок.Контрагент,ВыборкаДок.ЗаказКлиента));
			КонецЦикла;
			
			Задача.Описание=СтрШаблон("Создано поступление товаров:
							|%1
							|по заказам поставщику
							|%2
							|по заказам клиентов
							|%3",Источник.Ссылка,СтрСоединить(МассивЗП,","),СтрСоединить(МассивЗК,","));
			Задача.Записать();
			
			Напоминание=РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
			Напоминание.Пользователь=Выборка.Ответственный;
			Напоминание.ВремяСобытия=ТекущаяДата();
			Напоминание.Источник=Задача.Ссылка;
			Напоминание.СрокНапоминания=ТекущаяДата();
			Напоминание.Описание=Задача.Описание;
			Напоминание.СпособУстановкиВремениНапоминания=Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
			Напоминание.ПредставлениеИсточника=Источник.Ссылка;
			Напоминание.Записать(Истина);
			
		КонецЦикла;
		
		рег=РегистрыСведений.АУ_ОповещенияОПоступленияхТоваров.СоздатьМенеджерЗаписи();
		рег.Поступление=Источник.Ссылка;
		рег.ОповещениеСформировано=Истина;
		рег.Записать(Истина);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьEmailКонтрагента(Контрагент) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	       |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	       |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	       |ИЗ
	       |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	       |ГДЕ
	       |	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
	       |	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	Запрос.УстановитьПараметр("Ссылка",Контрагент);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.АдресЭП),Выборка.АдресЭП,Выборка.Представление);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьEmailОбъекта(ТекОбъект) Экспорт
	
	Для каждого стрКонтакт Из ТекОбъект.КонтактнаяИнформация Цикл
		Если стрКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Возврат ?(ЗначениеЗаполнено(стрКонтакт.АдресЭП), стрКонтакт.АдресЭП, стрКонтакт.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция СоздатьЗадачуИсполнителю(Исполнитель, Наименование, Предмет) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	Задача.Дата = ТекущаяДатаСеанса();
	Задача.Исполнитель = Исполнитель;
	Задача.Наименование = Наименование;
	Задача.Предмет = Предмет;
	Задача.Автор = Пользователи.АвторизованныйПользователь();
	Задача.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	Задача.ПредметСтрокой = Предмет;
	Задача.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задача.Ссылка;
	
КонецФункции

Функция ПолучитьБлижайшуюРабочуюДату(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ДанныеПроизводственногоКалендаря.Дата) КАК Дата
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата >= &Дата
	|	И ДанныеПроизводственногоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))";
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

Функция ДобавитьКДатеРабочиеДни(ДатаСтарта, КоличествоДней)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
    |	ВЫБОР
    |		КОГДА Т.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
    |				ИЛИ Т.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
    |			ТОГДА 1
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ЧислоРабочихДней,
    |	Т.Дата КАК ДатаКалендаря
    |ПОМЕСТИТЬ ТЗ
    |ИЗ
    |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Т
    |ГДЕ
    |	Т.Дата МЕЖДУ &ДатаСтарта И &ДатаПредела
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТЗ.ДатаКалендаря КАК ДатаКалендаря,
    |	СУММА(ТЗ1.ЧислоРабочихДней) КАК ЧислоРабочихДней
    |ПОМЕСТИТЬ ТЗНакопл
    |ИЗ
    |	ТЗ КАК ТЗ
    |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ1
    |		ПО (ТЗ1.ДатаКалендаря <= ТЗ.ДатаКалендаря)
    |
    |СГРУППИРОВАТЬ ПО
    |	ТЗ.ДатаКалендаря
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МАКСИМУМ(ТЗ.ДатаКалендаря) КАК ДатаКалендаря
    |ИЗ
    |	ТЗНакопл КАК ТЗ
    |ГДЕ
    |	ТЗ.ЧислоРабочихДней = &ЧислоРабочихДней";
	
	Запрос.УстановитьПараметр("ДатаСтарта", НачалоДня(ДатаСтарта));
	Запрос.УстановитьПараметр("ДатаПредела", НачалоДня(ДатаСтарта) + 86400 * (КоличествоДней + 30));
	Запрос.УстановитьПараметр("ЧислоРабочихДней", КоличествоДней);
	
	Если КоличествоДней < 0 Тогда
		Запрос.УстановитьПараметр("ДатаПредела", НачалоДня(ДатаСтарта) + 86400 * (КоличествоДней - 30));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<", ">");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаСтарта И &ДатаПредела", "&ДатаПредела И &ДатаСтарта");
		Запрос.УстановитьПараметр("ЧислоРабочихДней", - КоличествоДней);
	КонецЕсли;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.ДатаКалендаря <> NULL Тогда
		Возврат Выборка.ДатаКалендаря;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТелефонКонтактногоЛица(Контакт) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Контакты.НомерТелефона КАК НомерТелефона,
	             |	Контакты.Представление КАК Представление
	             |ИЗ
	             |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Контакты
	             |ГДЕ
	             |	Контакты.Ссылка = &Ссылка
	             |	И Контакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	             |	И НЕ Контакты.НомерТелефона = """"";
	Запрос.УстановитьПараметр("Ссылка",Контакт);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Представление), Выборка.Представление, Выборка.НомерТелефона);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКлючевыеСтавки(ПериодНачало, ПериодОкончание) Экспорт
    
    КлючевыеСтавки = Новый ТаблицаЗначений;
    КлючевыеСтавки.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
    КлючевыеСтавки.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Любой)));
        
    СоединениеSSL     = Новый ЗащищенноеСоединениеOpenSSL();
    Определения         = Новый WSОпределения("https://www.cbr.ru/DailyInfoWebServ/DailyInfo.asmx?WSDL", , , , , СоединениеSSL);
    Прокси             = Новый WSПрокси(Определения,"http://web.cbr.ru/","DailyInfo","DailyInfoSoap", , , СоединениеSSL);    
    KeyRateXMLТип         = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("KeyRateXML");
    KeyRateXMLОбъект     = Прокси.ФабрикаXDTO.Создать(KeyRateXMLТип);
    KeyRateXMLОбъект.fromDate     = ПериодНачало;
    KeyRateXMLОбъект.ToDate         = ПериодОкончание;
    
    КлючевыеСтавкиОбъект = Прокси.KeyRateXML(KeyRateXMLОбъект);
    
    Для каждого rcdKR Из КлючевыеСтавкиОбъект.KeyRateXMLResult.KeyRate.KR Цикл
        стрКлючевыеСтавки = КлючевыеСтавки.Добавить();
        стрКлючевыеСтавки.Период     = XMLЗначение(Тип("Дата"), rcdKR.DT);
        стрКлючевыеСтавки.Значение     = XMLЗначение(Тип("Число"), rcdKR.Rate);
    КонецЦикла; 
    
    КлючевыеСтавки.Сортировать("Период");
    
    Возврат КлючевыеСтавки;
    
КонецФункции

Процедура АУ_ЗагрузкаСтавкиРефинансирования() Экспорт
	
	ТаблицаСтавок = ПолучитьКлючевыеСтавки(ТекущаяДата(), ТекущаяДата() - 86400 * 3);
	
	Для каждого стрСтавка Из ТаблицаСтавок Цикл
		
		рег = РегистрыСведений.АУ_СтавкиРефинансированияЦБ.СоздатьМенеджерЗаписи();
		рег.Период = стрСтавка.Период;
		рег.Ставка = стрСтавка.Значение;
		рег.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АУ_УведомленияОСрокеВыполненияКонтракта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.АУ_КрайняяДатаПоставки КАК АУ_КрайняяДатаПоставки,
	|	ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта КАК АУ_ПеренесенныйСрокИсполненияКонтракта,
	|	ЗаказКлиента.Договор.Номер КАК ДоговорНомер
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО СостоянияЗаказовКлиентов.Заказ = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.Задание КАК Задание
	|		ПО (ЗаказКлиента.Ссылка = Задание.Предмет)
	|			И (Задание.АУ_ВидЗадания = ЗНАЧЕНИЕ(Перечисление.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта = &АУ_ПеренесенныйСрокИсполненияКонтракта
	|			КОГДА НЕ ЗаказКлиента.АУ_КрайняяДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЗаказКлиента.АУ_КрайняяДатаПоставки = &АУ_КрайняяДатаПоставки
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ СостоянияЗаказовКлиентов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию))
	|	И ЕСТЬNULL(Задание.Завершен, ИСТИНА) = ИСТИНА
	|	И НЕ ЗаказКлиента.АУ_НеФормироватьЗапросОСрокахИсполненияЗаказа
	|	И НЕ СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100";
	
	Запрос.УстановитьПараметр("АУ_КрайняяДатаПоставки", НачалоДня(ТекущаяДатаСеанса() + 86400 * 15));
	Запрос.УстановитьПараметр("АУ_ПеренесенныйСрокИсполненияКонтракта", НачалоДня(ТекущаяДатаСеанса() + 86400 * 13));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Задание = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
		Задание.Дата = ТекущаяДатаСеанса();
		Задание.Автор = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ПользовательУведомленияОПереносеСроковИсполненияКонтракта");
		Задание.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		Задание.Исполнитель = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("РуководительОтделаЗакупок");
		Задание.Предмет = Выборка.Ссылка;
		Задание.Наименование = СтрШаблон("Обеспечение. Уточнение даты поставки товара, дата исполнения ГК №%1 Заказ клиента %2", Выборка.ДоговорНомер, Выборка.Ссылка);
		Задание.Проверяющий = Задание.Автор;
		Задание.Содержание = "Необходимо уточнить срок исполнения контракта и отметить в задаче";
		Задание.АУ_ВидЗадания = Перечисления.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта;
		
		Если ЗначениеЗаполнено(Выборка.АУ_ПеренесенныйСрокИсполненияКонтракта) Тогда
			Задание.СрокИсполнения = ДобавитьКДатеРабочиеДни(Задание.Дата, 3);
		Иначе
			Задание.СрокИсполнения = ДобавитьКДатеРабочиеДни(Задание.Дата, 2);
		КонецЕсли;
		
		Задание.Записать();
		Задание.Старт();
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиЧислаВСтроке(Строка) Экспорт

   МассивЧисел = Новый Массив;

   СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1);

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(СтрокаЧисел);
         СтрокаЧисел = "";
      КонецЕсли;
   
  КонецЦикла;
  
   Если СтрДлина(СтрокаЧисел)>0 Тогда
       МассивЧисел.Добавить(СтрокаЧисел);
   КонецЕсли;
   
   Возврат МассивЧисел;

КонецФункции

Функция СоздатьСтруктуруПоРегиструСведений(ИмяРегистраСведений) Экспорт
	
    // Получаем описание регистра сведений из метаданных
    РегистрСведений = Метаданные.РегистрыСведений[ИмяРегистраСведений];
    
    // Проверяем, существует ли указанный регистр сведений
    Если РегистрСведений = Неопределено Тогда
        ВызватьИсключение "Регистр сведений '" + ИмяРегистраСведений + "' не найден!";
    КонецЕсли;
    
    // Создаем новую структуру
    НоваяСтруктура = Новый Структура;
    
    // Добавляем измерения
    Для Каждого Измерение Из РегистрСведений.Измерения Цикл
        НоваяСтруктура.Вставить(Измерение.Имя, Неопределено);
    КонецЦикла;
    
    // Добавляем ресурсы
    Для Каждого Ресурс Из РегистрСведений.Ресурсы Цикл
        НоваяСтруктура.Вставить(Ресурс.Имя, Неопределено);
    КонецЦикла;
    
    // Возвращаем созданную структуру
    Возврат НоваяСтруктура;
	
КонецФункции

Функция ПолучитьАдресаПочтыПользователей(мПользователи, АдресаДляОтправкиСтрокой = "") Экспорт
	
	МассивАдресов = Новый Массив;
	
	ОтборПользователей = Новый Массив;
	Если ТипЗнч(мПользователи) = Тип("Массив") Тогда
		ОтборПользователей  = мПользователи;
	ИначеЕсли ТипЗнч(мПользователи) = Тип("СправочникСсылка.Пользователи") Тогда
		ОтборПользователей.Добавить(мПользователи);
	Иначе
		Возврат МассивАдресов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Ссылка В(&Пользователи)
	|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ПользователиКонтактнаяИнформация.АдресЭП <> """"";
	
	Запрос.УстановитьПараметр("Пользователи", ОтборПользователей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивАдресов.Добавить(Новый Структура("Адрес,Представление", Выборка.АдресЭП, Выборка.Ссылка));
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Выборка.АдресЭП;
		
	КонецЦикла;
		
	Возврат МассивАдресов;

КонецФункции

Процедура ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(Форма, ИмяРеквизита = "ТоварыНоменклатура") Экспорт
	
	МассивПараметров = Новый Массив;
	Для каждого стрПараметр Из Форма.Элементы[ИмяРеквизита].ПараметрыВыбора Цикл
		МассивПараметров.Добавить(стрПараметр);
	КонецЦикла;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.АУ_ВАрхиве", Ложь));
	
	Форма.Элементы[ИмяРеквизита].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры


#Область ПрограммныйИнтерфейс

// Возвращает граничную дату: если срок годности серии меньше этой даты, до истечения осталось менее 1 года от даты документа.
//
// Параметры:
//  ОбъектДокумента - документ
//
// Возвращаемое значение:
//  Дата - дата документа + 12 месяцев.
//
Функция ГраничнаяДатаСрокаГодностиСерий(ЗНАЧ ОбъектДокумента) Экспорт
	
	ДатаДокумента = ОбъектДокумента.Дата;
	КоличествоМесяцев = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("КоличествоМесяцевДоИстеченияСрокаГодностиСерий");
	
	Если ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Распоряжение = ОбъектДокумента.Распоряжение;
	ИначеЕсли ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		
		Для каждого стрТовары Из ОбъектДокумента.ТоварыПоРаспоряжениям Цикл
			Если ЗначениеЗаполнено(стрТовары.Распоряжение) Тогда
				Распоряжение = стрТовары.Распоряжение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжение) И НЕ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Распоряжение.Контрагент);
		Массив.Добавить(Распоряжение.Партнер);
		
		ЗначенияРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Массив, "АУ_КоличествоМесяцевДоИстеченияСрокаГодностиСерий");
		
		Если ЗначенияРеквизита[Распоряжение.Контрагент] <> 0 Тогда
			КоличествоМесяцев = ЗначенияРеквизита[Распоряжение.Контрагент];
		ИначеЕсли ЗначенияРеквизита[Распоряжение.Партнер] <> 0 Тогда
			КоличествоМесяцев = ЗначенияРеквизита[Распоряжение.Партнер];
		КонецЕсли;
		
	КонецЕсли;
	
	Если КоличествоМесяцев = 0 Тогда
		КоличествоМесяцев = 12;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ДобавитьМесяц(НачалоДня(ДатаДокумента), КоличествоМесяцев);
	
КонецФункции

// Проверяет наличие серий с заполненным сроком годности менее 1 года от даты документа.
//
// Параметры:
//  ДатаДокумента - Дата - дата документа.
//  ОбъектДокумента - ДокументОбъект - объект документа.
//  ИменаТабличныхЧастей - Массив из Строка - имена табличных частей с реквизитом Серия.
//
// Возвращаемое значение:
//  Булево - Истина, если найдена хотя бы одна подходящая серия.
//
Функция ЕстьСерииСИстекающимСрокомГодности(ДатаДокумента, ОбъектДокумента, ИменаТабличныхЧастей) Экспорт
	
	Серии = Новый Массив;
	УникальныеСерии = Новый Соответствие;
	
	Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
		
		ТабличнаяЧасть = ОбъектДокумента[ИмяТабличнойЧасти];
		
		Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Серия) Тогда
				Продолжить;
			КонецЕсли;
			
			Если УникальныеСерии[СтрокаТабличнойЧасти.Серия] = Неопределено Тогда
				УникальныеСерии.Вставить(СтрокаТабличнойЧасти.Серия, Истина);
				Серии.Добавить(СтрокаТабличнойЧасти.Серия);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Серии.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГраничнаяДата = ГраничнаяДатаСрокаГодностиСерий(ОбъектДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК Серии
	|ГДЕ
	|	Серии.Ссылка В(&Серии)
	|	И Серии.ГоденДо <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Серии.ГоденДо < &ГраничнаяДата";
	
	Запрос.УстановитьПараметр("Серии", Серии);
	Запрос.УстановитьПараметр("ГраничнаяДата", ГраничнаяДата);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Добавляет условное оформление строк таблицы: красный шрифт для серий с истекающим сроком годности.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//  ИмяЭлементаТаблицы - Строка - имя элемента таблицы на форме (например, "Товары").
//  ПутьКПолюСерии - Строка - путь к реквизиту Серия в данных строки (например, "Объект.Товары.Серия").
//  ИмяРеквизитаГраничнойДаты - Строка - имя реквизита формы с граничной датой.
//
Процедура УстановитьУсловноеОформлениеИстекающихСерий(Форма, ИмяЭлементаТаблицы, ПутьКПолюСерии, ИмяРеквизитаГраничнойДаты, МассивРеквизитовПосветки) Экспорт
	
	ПутьГоденДо = ПутьКПолюСерии + ".АУ_СрокГодности";
	
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();
	
	Для каждого Имя Из МассивРеквизитовПосветки Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Имя);
	КонецЦикла;
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюСерии);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьГоденДо);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьГоденДо);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ИмяРеквизитаГраничнойДаты);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

// Создаёт служебные реквизиты формы для проверки и условного оформления.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ПодготовитьРеквизитыФормыДляИстекающихСерий(Форма) Экспорт
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(Форма, "АУ_ГраничнаяДатаСрокаГодностиСерий", Новый ОписаниеТипов("Дата"));
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("АУ_СрокГодности", АУ_СозданиеЭлементовФормы.ОписаниеТипаДатаВремя("Дата"));
	
	Если Форма.Элементы.Найти("Товары") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.Товары", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.Товары);
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ТоварыПоРаспоряжениям") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.ТоварыПоРаспоряжениям", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.ТоварыПоРаспоряжениям);
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ОтгружаемыеТовары") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.ОтгружаемыеТовары", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.ОтгружаемыеТовары);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет граничную дату на форме по дате документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ОбновитьГраничнуюДатуНаФормеДляИстекающихСерий(Форма) Экспорт
	
	Форма.АУ_ГраничнаяДатаСрокаГодностиСерий = ГраничнаяДатаСрокаГодностиСерий(Форма.Объект);
	
КонецПроцедуры

// Заполняет реквизит АУ_СрокГодности в строке табличной части Товары по серии номенклатуры.
//
// Параметры:
//  СтрокаТовары - СтрокаТабличнойЧасти - строка табличной части Товары документа ПриходныйОрдерНаТовары.
//
Процедура ЗаполнитьСрокГодностиВСтрокеТовары(СтрокаТовары) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
		СтрокаТовары.АУ_СрокГодности = Дата(1, 1, 1);
		Возврат;
	КонецЕсли;
	
	СтрокаТовары.АУ_СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Серия, "ГоденДо");
	
КонецПроцедуры

// Заполняет реквизит АУ_СрокГодности во всех строках табличной части Товары по сериям номенклатуры.
//
// Параметры:
//  ТабличнаяЧастьТовары - ТабличнаяЧасть - табличная часть Товары документа ПриходныйОрдерНаТовары.
//
Процедура ЗаполнитьСрокГодностиТабличнойЧастиТовары(ТабличнаяЧастьТовары) Экспорт
	
	Серии = Новый Массив;
	УникальныеСерии = Новый Соответствие;
	
	Для Каждого СтрокаТовары Из ТабличнаяЧастьТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
			Продолжить;
		КонецЕсли;
		
		Если УникальныеСерии[СтрокаТовары.Серия] = Неопределено Тогда
			УникальныеСерии.Вставить(СтрокаТовары.Серия, Истина);
			Серии.Добавить(СтрокаТовары.Серия);
		КонецЕсли;
		
	КонецЦикла;
	
	СрокиГодностиПоСериям = Новый Соответствие;
	
	Если Серии.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Серии.Ссылка КАК Серия,
		|	Серии.ГоденДо КАК ГоденДо
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК Серии
		|ГДЕ
		|	Серии.Ссылка В(&Серии)";
		
		Запрос.УстановитьПараметр("Серии", Серии);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СрокиГодностиПоСериям.Вставить(Выборка.Серия, Выборка.ГоденДо);
		КонецЦикла;
		
	КонецЕсли;
	
	ПустаяДата = Дата(1, 1, 1);
	
	Для Каждого СтрокаТовары Из ТабличнаяЧастьТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
			СтрокаТовары.АУ_СрокГодности = ПустаяДата;
			Продолжить;
		КонецЕсли;
		
		СрокГодности = СрокиГодностиПоСериям[СтрокаТовары.Серия];
		Если СрокГодности = Неопределено Тогда
			СтрокаТовары.АУ_СрокГодности = ПустаяДата;
		Иначе
			СтрокаТовары.АУ_СрокГодности = СрокГодности;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



#Область ПрограммныйИнтерфейс

// Возвращает Истина, если у вида номенклатуры заполнен реквизит ОсобенностьУчета.
//
// Параметры:
//  ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры
//
// Возвращаемое значение:
//  Булево
//
Функция АУ_ЭтоМаркируемыйВидНоменклатуры(ВидНоменклатуры) Экспорт

	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ЗначениеЗаполнено(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ОсобенностьУчета"));

КонецФункции

// Находит существующую парную карточку или создаёт копию со сменой вида и префиксом имени.
//
// Параметры:
//  НоменклатураСсылка - СправочникСсылка.Номенклатура
//
// Возвращаемое значение:
//  Структура - Успех, ТекстОшибки, ПарнаяНоменклатура
//
Функция АУ_СоздатьИлиНайтиПарнуюНоменклатуру(НоменклатураСсылка) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки, ПарнаяНоменклатура", Ложь, "", Справочники.Номенклатура.ПустаяСсылка());

	Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Сначала запишите карточку номенклатуры.'");
		Возврат Результат;
	КонецЕсли;

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НоменклатураСсылка, "АУ_НоменклатураСмаркировкой, ВидНоменклатуры, Наименование, НаименованиеПолное");

	Если ЗначениеЗаполнено(Реквизиты.АУ_НоменклатураСмаркировкой)
		И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.АУ_НоменклатураСмаркировкой, "ПометкаУдаления") Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Связь с парной карточкой уже заполнена.'");
		Результат.ПарнаяНоменклатура = Реквизиты.АУ_НоменклатураСмаркировкой;
		Возврат Результат;
	КонецЕсли;

	ОбратнаяПара = НайтиОбратнуюПарнуюНоменклатуру(НоменклатураСсылка);
	Если ЗначениеЗаполнено(ОбратнаяПара) Тогда
		ЗаписатьСвязьПары(НоменклатураСсылка, ОбратнаяПара);
		ЗаписатьПубличныеИдентификаторыПары(НоменклатураСсылка, ОбратнаяПара);
		Результат.Успех = Истина;
		Результат.ПарнаяНоменклатура = ОбратнаяПара;
		Возврат Результат;
	КонецЕсли;

	ПарныйВид = ПарныйВидНоменклатуры(Реквизиты.ВидНоменклатуры);
	Если Не ЗначениеЗаполнено(ПарныйВид) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Нет соответствия видов номенклатуры маркировки. Заполните регистр соответствия видов.'");
		Возврат Результат;
	КонецЕсли;

	ТекущаяМаркируемая = АУ_ЭтоМаркируемыйВидНоменклатуры(Реквизиты.ВидНоменклатуры);
	ПарнаяМаркируемая = АУ_ЭтоМаркируемыйВидНоменклатуры(ПарныйВид);
	Если ТекущаяМаркируемая = ПарнаяМаркируемая Тогда
		Результат.ТекстОшибки = НСтр("ru = 'У парного вида маркируемость не противоположна текущему виду.'");
		Возврат Результат;
	КонецЕсли;

	НовыйЭлемент = НоменклатураСсылка.Скопировать();
	НовыйЭлемент.ВидНоменклатуры = ПарныйВид;

	РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ПарныйВид,
		"ИспользованиеХарактеристик, ВладелецХарактеристик, ВладелецСерий, ОсобенностьУчета, ТипНоменклатуры, ИспользоватьСерии");
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, РеквизитыВида);

	Если Не РеквизитыВида.ИспользоватьСерии Тогда
		НовыйЭлемент.ВладелецСерий = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Если РеквизитыВида.ИспользованиеХарактеристик
		= Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		НовыйЭлемент.ВладелецХарактеристик = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Если Не ПарнаяМаркируемая Тогда
		НовыйЭлемент.КиЗГИСМGTIN = "";
		НовыйЭлемент.ПродукцияМаркируемаяДляГИСМ = Ложь;
		НовыйЭлемент.КиЗГИСМ = Ложь;
	КонецЕсли;

	Префикс = ?(ПарнаяМаркируемая, "(маркировка) ", "(без маркировки) ");
	НовыйЭлемент.Наименование = ДобавитьПрефиксИмени(Реквизиты.Наименование, Префикс);
	Если ЗначениеЗаполнено(Реквизиты.НаименованиеПолное) Тогда
		НовыйЭлемент.НаименованиеПолное = ДобавитьПрефиксИмени(Реквизиты.НаименованиеПолное, Префикс);
	КонецЕсли;

	НовыйЭлемент.АУ_НоменклатураСмаркировкой = НоменклатураСсылка;
	НовыйЭлемент.Записать();

	ОчиститьШтрихкодыНоменклатуры(НовыйЭлемент.Ссылка);
	ЗаписатьСвязьПары(НоменклатураСсылка, НовыйЭлемент.Ссылка);
	ЗаписатьПубличныеИдентификаторыПары(НоменклатураСсылка, НовыйЭлемент.Ссылка);

	Результат.Успех = Истина;
	Результат.ПарнаяНоменклатура = НовыйЭлемент.Ссылка;
	Возврат Результат;

КонецФункции

// Меняет номенклатуру текущей строки документа на парную и связанные строки оснований поступления.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПриобретениеТоваровУслуг, ДокументСсылка.ПриходныйОрдерНаТовары
//  НомерСтрокиТовары - Число
//
// Возвращаемое значение:
//  Структура - Успех, ТекстОшибки, ОписаниеЦепочки
//
Функция АУ_СменитьМаркировкуВСтрокеДокумента(ДокументСсылка, НомерСтрокиТовары) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки, ОписаниеЦепочки", Ложь, "", "");

	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Сначала запишите документ.'");
		Возврат Результат;
	КонецЕсли;

	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	СтрокаИсточника = СтрокаТоваровПоНомеру(ДокументОбъект, НомерСтрокиТовары);
	Если СтрокаИсточника = Неопределено Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не найдена строка табличной части Товары.'");
		Возврат Результат;
	КонецЕсли;

	СтараяНоменклатура = СтрокаИсточника.Номенклатура;
	ПарнаяНоменклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтараяНоменклатура, "АУ_НоменклатураСмаркировкой");
	Если Не ЗначениеЗаполнено(ПарнаяНоменклатура) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'У номенклатуры текущей строки не заполнена парная карточка.'");
		Возврат Результат;
	КонецЕсли;

	КонтекстСтроки = КонтекстСтрокиИсточника(СтрокаИсточника, СтараяНоменклатура, ПарнаяНоменклатура);
	Причины = Новый Массив;
	Цепочка = СобратьОснованияПоступления(ДокументОбъект, СтрокаИсточника, КонтекстСтроки, Причины);
	Если Причины.Количество() > 0 Тогда
		Результат.ТекстОшибки = СтрСоединить(Причины, Символы.ПС);
		Возврат Результат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	КонтекстОбходаКонтроля = ВключитьОбходКонтроляПриСменеМаркировки();
	НачатьТранзакцию();
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
	Попытка
		ОтчётЦепочки = Новый Массив;
		Для Каждого ЭлементЦепочки Из Цепочка Цикл
			СтатусЗаписи = ЗаписатьДокументСоСменойМаркировки(ЭлементЦепочки, КонтекстСтроки);
			ОтчётЦепочки.Добавить(Строка(ЭлементЦепочки.Ссылка) + ": " + СтатусЗаписи);
		КонецЦикла;

		ЗафиксироватьТранзакцию();
		ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
		ВыключитьОбходКонтроляПриСменеМаркировки(КонтекстОбходаКонтроля);
		УстановитьПривилегированныйРежим(Ложь);
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;

	ВыключитьОбходКонтроляПриСменеМаркировки(КонтекстОбходаКонтроля);
	УстановитьПривилегированныйРежим(Ложь);
	АУ_КонтрольЗаказаКлиентаСервер.ПометитьКПересчету(ДокументСсылка);

	Результат.Успех = Истина;
		Результат.ОписаниеЦепочки = СтрСоединить(ОтчётЦепочки, Символы.ПС);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиОбратнуюПарнуюНоменклатуру(НоменклатураСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.АУ_НоменклатураСмаркировкой = &Номенклатура
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка <> &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Номенклатура.ПустаяСсылка();

КонецФункции

Функция ПарныйВидНоменклатуры(ВидНоменклатуры)

	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Запись = РегистрыСведений.АУ_СоответствиеВидовНоменклатурыМаркировки.СоздатьМенеджерЗаписи();
	Запись.ВидНоменклатуры = ВидНоменклатуры;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ПарныйВидНоменклатуры;
	КонецЕсли;

	Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();

КонецФункции

Процедура ЗаписатьСвязьПары(ПерваяСсылка, ВтораяСсылка)

	ОбъектПервый = ПерваяСсылка.ПолучитьОбъект();
	Если ОбъектПервый.АУ_НоменклатураСмаркировкой <> ВтораяСсылка Тогда
		ОбъектПервый.АУ_НоменклатураСмаркировкой = ВтораяСсылка;
		ОбъектПервый.Записать();
	КонецЕсли;

	ОбъектВторой = ВтораяСсылка.ПолучитьОбъект();
	Если ОбъектВторой.АУ_НоменклатураСмаркировкой <> ПерваяСсылка Тогда
		ОбъектВторой.АУ_НоменклатураСмаркировкой = ПерваяСсылка;
		ОбъектВторой.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьПубличныеИдентификаторыПары(ИсходнаяНоменклатура, ПарнаяНоменклатура)

	Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду(
		"50e1e88f-c391-4c75-abe3-1ed5c94f29cc");
	Идентификатор = ИсходнаяНоменклатура.УникальныйИдентификатор();

	ЗаписьРегистра = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Идентификатор = Идентификатор;
	ЗаписьРегистра.Ссылка = ИсходнаяНоменклатура;
	ЗаписьРегистра.УзелИнформационнойБазы = Узел;
	ЗаписьРегистра.Записать(Истина);

	ЗаписьРегистра = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Идентификатор = Идентификатор;
	ЗаписьРегистра.Ссылка = ПарнаяНоменклатура;
	ЗаписьРегистра.УзелИнформационнойБазы = Узел;
	ЗаписьРегистра.Записать(Истина);

КонецПроцедуры

Функция ДобавитьПрефиксИмени(ИсходноеИмя, Префикс)

	Если СтрНачинаетсяС(ИсходноеИмя, "(маркировка)")
		Или СтрНачинаетсяС(ИсходноеИмя, "(без маркировки)") Тогда
		Возврат ИсходноеИмя;
	КонецЕсли;

	Возврат Префикс + ИсходноеИмя;

КонецФункции

Процедура ОчиститьШтрихкодыНоменклатуры(НоменклатураСсылка)

	Попытка
		Набор = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(НоменклатураСсылка);
		Набор.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АУ.ПарнаяНоменклатура.Штрихкоды'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.Номенклатура,
			НоменклатураСсылка,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Функция СтрокаТоваровПоНомеру(ДокументОбъект, НомерСтрокиТовары)

	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
		Если СтрокаТовары.НомерСтроки = НомерСтрокиТовары Тогда
			Возврат СтрокаТовары;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция КонтекстСтрокиИсточника(СтрокаИсточника, СтараяНоменклатура, ПарнаяНоменклатура)

	Контекст = Новый Структура;
	Контекст.Вставить("СтараяНоменклатура", СтараяНоменклатура);
	Контекст.Вставить("ПарнаяНоменклатура", ПарнаяНоменклатура);
	Контекст.Вставить("Количество", СтрокаИсточника.Количество);
	Контекст.Вставить("Характеристика", ЗначениеСвойстваСтроки(СтрокаИсточника, "Характеристика"));
	Контекст.Вставить("Назначение", ЗначениеСвойстваСтроки(СтрокаИсточника, "Назначение"));
	Контекст.Вставить("Серия", ЗначениеСвойстваСтроки(СтрокаИсточника, "Серия"));
	Контекст.Вставить("КодСтроки", ЗначениеСвойстваСтроки(СтрокаИсточника, "КодСтроки"));
	Контекст.Вставить("ОчиститьХарактеристику",
		Не ВидИспользуетХарактеристики(ПарнаяНоменклатура));

	Возврат Контекст;

КонецФункции

Функция ВидИспользуетХарактеристики(НоменклатураСсылка)

	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураСсылка, "ВидНоменклатуры");
	Использование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
	Возврат Использование <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;

КонецФункции

Функция ЗначениеСвойстваСтроки(СтрокаДанных, ИмяСвойства)

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных, ИмяСвойства) Тогда
		Возврат СтрокаДанных[ИмяСвойства];
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СобратьОснованияПоступления(ДокументОбъект, СтрокаИсточника, КонтекстСтроки, Причины)

	Цепочка = Новый Массив;
	ДобавитьЭлементЦепочки(Цепочка, ДокументОбъект, СтрокаИсточника, Истина);

	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Распоряжение = ДокументОбъект.Распоряжение;
		Если ЗначениеЗаполнено(Распоряжение) И ЭтоДокументБелогоСписка(Распоряжение) Тогда
			ДобавитьСвязанныйДокумент(Цепочка, Распоряжение, КонтекстСтроки, Причины, СтрокаИсточника);
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ДобавитьЗаказыПриобретения(Цепочка, ДокументОбъект, СтрокаИсточника, КонтекстСтроки, Причины);
	КонецЕсли;

	Для Каждого ЭлементЦепочки Из КопияМассива(Цепочка) Цикл
		Если ТипЗнч(ЭлементЦепочки.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
			И ЭлементЦепочки.Ссылка <> ДокументОбъект.Ссылка Тогда
			ДокументПТИУ = ЭлементЦепочки.Объект;
			СтрокаПТИУ = ЭлементЦепочки.СтрокаТовары;
			ДобавитьЗаказыПриобретения(Цепочка, ДокументПТИУ, СтрокаПТИУ, КонтекстСтроки, Причины);
		КонецЕсли;
	КонецЦикла;

	Возврат Цепочка;

КонецФункции

Функция ЭтоДокументБелогоСписка(СсылкаДокумента)

	ТипДокумента = ТипЗнч(СсылкаДокумента);
	Возврат ТипДокумента = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
		Или ТипДокумента = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ЗаказПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента")
		Или ТипДокумента = Тип("ДокументСсылка.ЗаказНаСборку")
		Или ТипДокумента = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление");

КонецФункции

Процедура ДобавитьЗаказыПриобретения(Цепочка, ДокументПТИУ, СтрокаПТИУ, КонтекстСтроки, Причины)

	ЗаказИзШапки = ДокументПТИУ.ЗаказПоставщику;
	ЗаказИзСтроки = ЗначениеСвойстваСтроки(СтрокаПТИУ, "ЗаказПоставщику");

	Если ЗначениеЗаполнено(ЗаказИзСтроки) Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ЗаказИзСтроки, КонтекстСтроки, Причины, СтрокаПТИУ);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаказИзШапки) И ЗаказИзШапки <> ЗаказИзСтроки Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ЗаказИзШапки, КонтекстСтроки, Причины, СтрокаПТИУ);
	КонецЕсли;

	Для Каждого ЭлементЦепочки Из КопияМассива(Цепочка) Цикл
		Если ТипЗнч(ЭлементЦепочки.Ссылка) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьОснованияЗаказаПоставщику(Цепочка, ЭлементЦепочки.Объект, ЭлементЦепочки.СтрокаТовары, КонтекстСтроки, Причины);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьОснованияЗаказаПоставщику(Цепочка, ЗаказОбъект, СтрокаЗаказа, КонтекстСтроки, Причины)

	ЗаказКлиентаСтроки = ЗначениеСвойстваСтроки(СтрокаЗаказа, "АУ_ЗаказКлиента");
	ЗаказСборкиСтроки = ЗначениеСвойстваСтроки(СтрокаЗаказа, "АУ_ЗаказНаСборку");
	ОснованиеШапки = ЗаказОбъект.ДокументОснование;

	Если ЗначениеЗаполнено(ЗаказКлиентаСтроки) Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ЗаказКлиентаСтроки, КонтекстСтроки, Причины, СтрокаЗаказа);
	ИначеЕсли ТипЗнч(ОснованиеШапки) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ОснованиеШапки, КонтекстСтроки, Причины, СтрокаЗаказа);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗаказСборкиСтроки) Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ЗаказСборкиСтроки, КонтекстСтроки, Причины, СтрокаЗаказа);
	ИначеЕсли ТипЗнч(ОснованиеШапки) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ОснованиеШапки, КонтекстСтроки, Причины, СтрокаЗаказа);
	КонецЕсли;

	Если ТипЗнч(ОснованиеШапки) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		ДобавитьСвязанныйДокумент(Цепочка, ОснованиеШапки, КонтекстСтроки, Причины, СтрокаЗаказа);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСвязанныйДокумент(Цепочка, СсылкаДокумента, КонтекстСтроки, Причины, СтрокаИсточникаСвязи)

	Если Не ЗначениеЗаполнено(СсылкаДокумента) Или Не ЭтоДокументБелогоСписка(СсылкаДокумента) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЭлементЦепочки Из Цепочка Цикл
		Если ЭлементЦепочки.Ссылка = СсылкаДокумента Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	ДокументОбъект = СсылкаДокумента.ПолучитьОбъект();
	СтрокаТовары = НайтиСвязаннуюСтроку(ДокументОбъект, КонтекстСтроки, СтрокаИсточникаСвязи);
	Если СтрокаТовары = Неопределено Тогда
		Причины.Добавить(СтрШаблон(
			НСтр("ru = 'В документе %1 не найдена связанная строка.'"),
			Строка(СсылкаДокумента)));
		Возврат;
	КонецЕсли;

	Если СтрокаТовары.Количество < КонтекстСтроки.Количество Тогда
		Причины.Добавить(СтрШаблон(
			НСтр("ru = 'В документе %1 количество связанной строки меньше количества текущей строки.'"),
			Строка(СсылкаДокумента)));
		Возврат;
	КонецЕсли;

	ДобавитьЭлементЦепочки(Цепочка, ДокументОбъект, СтрокаТовары, Ложь);

КонецПроцедуры

Процедура ДобавитьЭлементЦепочки(Цепочка, ДокументОбъект, СтрокаТовары, ЭтоИсточник)

	ЭлементЦепочки = Новый Структура;
	ЭлементЦепочки.Вставить("Ссылка", ДокументОбъект.Ссылка);
	ЭлементЦепочки.Вставить("Объект", ДокументОбъект);
	ЭлементЦепочки.Вставить("СтрокаТовары", СтрокаТовары);
	ЭлементЦепочки.Вставить("ЭтоИсточник", ЭтоИсточник);
	Цепочка.Добавить(ЭлементЦепочки);

КонецПроцедуры

Функция НайтиСвязаннуюСтроку(ДокументОбъект, КонтекстСтроки, СтрокаИсточникаСвязи)

	Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИдентификаторЗаказа = ЗначениеСвойстваСтроки(СтрокаИсточникаСвязи, "АУ_КодСтроки");
	КодСтрокиИсточника = ЗначениеСвойстваСтроки(СтрокаИсточникаСвязи, "КодСтроки");

	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл

		Если СтрокаТовары.Номенклатура <> КонтекстСтроки.СтараяНоменклатура Тогда
			Продолжить;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "Характеристика")
			И СтрокаТовары.Характеристика <> КонтекстСтроки.Характеристика Тогда
			Продолжить;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "Назначение")
			И СтрокаТовары.Назначение <> КонтекстСтроки.Назначение Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")
			И ЗначениеЗаполнено(ИдентификаторЗаказа)
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "ИдентификаторСтроки")
			И СтрокаТовары.ИдентификаторСтроки <> ИдентификаторЗаказа Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ЗначениеЗаполнено(КодСтрокиИсточника)
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "КодСтроки")
			И СтрокаТовары.КодСтроки <> КодСтрокиИсточника Тогда
			Продолжить;
		КонецЕсли;

		Возврат СтрокаТовары;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ЗаписатьДокументСоСменойМаркировки(ЭлементЦепочки, КонтекстСтроки)

	ДокументОбъект = ЭлементЦепочки.Объект;
	СтрокаТовары = ЭлементЦепочки.СтрокаТовары;

	Если ЭлементЦепочки.ЭтоИсточник Или СтрокаТовары.Количество = КонтекстСтроки.Количество Тогда
		ЗаменитьНоменклатуруВСтроке(СтрокаТовары, КонтекстСтроки);
	Иначе
		РазбитьСтрокуТоваров(ДокументОбъект, СтрокаТовары, КонтекстСтроки);
	КонецЕсли;

	ОбновитьСерииДокумента(ДокументОбъект, КонтекстСтроки);

	ДокументОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);

	БылПроведен = ДокументОбъект.Проведен;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

	Если Не БылПроведен Тогда
		Возврат НСтр("ru = 'записан'");
	КонецЕсли;

	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Возврат НСтр("ru = 'проведён'");
	Исключение
		ИсправитьНоменклатуруВДвижениях(ДокументОбъект.Ссылка, КонтекстСтроки);
		Возврат НСтр("ru = 'движения'");
	КонецПопытки;

КонецФункции

Процедура ЗаменитьНоменклатуруВСтроке(СтрокаТовары, КонтекстСтроки)

	СтрокаТовары.Номенклатура = КонтекстСтроки.ПарнаяНоменклатура;
	Если КонтекстСтроки.ОчиститьХарактеристику
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "Характеристика") Тогда
		СтрокаТовары.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РазбитьСтрокуТоваров(ДокументОбъект, СтрокаТовары, КонтекстСтроки)

	КоличествоОстаток = СтрокаТовары.Количество - КонтекстСтроки.Количество;
	КоэффициентУпаковки = 1;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "КоличествоУпаковок")
		И СтрокаТовары.Количество <> 0 Тогда
		КоэффициентУпаковки = СтрокаТовары.КоличествоУпаковок / СтрокаТовары.Количество;
	КонецЕсли;

	НоваяСтрока = ДокументОбъект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
	ЗаменитьНоменклатуруВСтроке(НоваяСтрока, КонтекстСтроки);
	НоваяСтрока.Количество = КонтекстСтроки.Количество;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "КоличествоУпаковок") Тогда
		НоваяСтрока.КоличествоУпаковок = КонтекстСтроки.Количество * КоэффициентУпаковки;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "КодСтроки") Тогда
		НоваяСтрока.КодСтроки = МаксимальныйКодСтроки(ДокументОбъект) + 1;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "ИдентификаторСтроки") Тогда
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

	СтрокаТовары.Количество = КоличествоОстаток;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "КоличествоУпаковок") Тогда
		СтрокаТовары.КоличествоУпаковок = КоличествоОстаток * КоэффициентУпаковки;
	КонецЕсли;

КонецПроцедуры

Функция КопияМассива(ИсходныйМассив)

	Результат = Новый Массив;
	Для Каждого ЭлементМассива Из ИсходныйМассив Цикл
		Результат.Добавить(ЭлементМассива);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция МаксимальныйКодСтроки(ДокументОбъект)

	Максимум = 0;
	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
		Если СтрокаТовары.КодСтроки > Максимум Тогда
			Максимум = СтрокаТовары.КодСтроки;
		КонецЕсли;
	КонецЦикла;

	Возврат Максимум;

КонецФункции

Процедура ОбновитьСерииДокумента(ДокументОбъект, КонтекстСтроки)

	Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Серии") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаСерии Из ДокументОбъект.Серии Цикл
		Если СтрокаСерии.Номенклатура <> КонтекстСтроки.СтараяНоменклатура Тогда
			Продолжить;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаСерии, "Характеристика")
			И СтрокаСерии.Характеристика <> КонтекстСтроки.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСерии.Номенклатура = КонтекстСтроки.ПарнаяНоменклатура;
		Если КонтекстСтроки.ОчиститьХарактеристику
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаСерии, "Характеристика") Тогда
			СтрокаСерии.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ИсправитьНоменклатуруВДвижениях(ДокументСсылка, КонтекстСтроки)

	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

	Для Каждого ДвижениеМетаданных Из ДокументСсылка.Метаданные().Движения Цикл

		Попытка
			НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ДвижениеМетаданных.ПолноеИмя()).СоздатьНаборЗаписей();
		Исключение
			Продолжить;
		КонецПопытки;

		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Прочитать();
		Изменён = Ложь;

		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗаписьНабора, "Номенклатура") Тогда
				Прервать;
			КонецЕсли;
			Если ЗаписьНабора.Номенклатура <> КонтекстСтроки.СтараяНоменклатура Тогда
				Продолжить;
			КонецЕсли;
			ЗаписьНабора.Номенклатура = КонтекстСтроки.ПарнаяНоменклатура;
			Если КонтекстСтроки.ОчиститьХарактеристику
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗаписьНабора, "Характеристика") Тогда
				ЗаписьНабора.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			Изменён = Истина;
		КонецЦикла;

		Если Изменён Тогда
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ВключитьОбходКонтроляПриСменеМаркировки()

	КонтекстОбхода = Новый Структура;
	КонтекстОбхода.Вставить("БезКонтроляОстатков",
		ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций);
	КонтекстОбхода.Вставить("БезКонтроляРезервов",
		ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам);

	ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Истина;
	ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам = Истина;

	Возврат КонтекстОбхода;

КонецФункции

Процедура ВыключитьОбходКонтроляПриСменеМаркировки(КонтекстОбхода)

	ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = КонтекстОбхода.БезКонтроляОстатков;
	ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам = КонтекстОбхода.БезКонтроляРезервов;

КонецПроцедуры

#КонецОбласти
